SunCity/src/InformationRegisters/ГрафикиРаботыМагазинов/ГрафикиРаботыМагазинов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГрафикиРаботыМагазинов</name>
  <resources>
    <name>Пятидневка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Шестидневка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КалендарныеДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидДня</name>
    <type>
      <types>EnumRef.ВидыДнейПроизводственногоКалендаря</types>
    </type>
  </resources>
  <resources>
    <name>РабочийДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидГрафикаРаботы</name>
    <type>
      <types>EnumRef.ВидыГрафиковРаботы</types>
    </type>
  </resources>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаКалендаря</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SunCity/src/Enums/ВидыДнейПроизводственногоКалендаря/ВидыДнейПроизводственногоКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДнейПроизводственногоКалендаря</name>
  <enumValues>
    <name>Рабочий</name>
    <comment>Рабочий день</comment>
  </enumValues>
  <enumValues>
    <name>Суббота</name>
  </enumValues>
  <enumValues>
    <name>Воскресенье</name>
  </enumValues>
  <enumValues>
    <name>Предпраздничный</name>
  </enumValues>
  <enumValues>
    <name>Праздник</name>
  </enumValues>
  <enumValues>
    <name>Нерабочий</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Enums/ВидыГрафиковРаботы/ВидыГрафиковРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыГрафиковРаботы</name>
  <enumValues>
    <name>Пятидневка</name>
  </enumValues>
  <enumValues>
    <name>Шестидневка</name>
  </enumValues>
  <enumValues>
    <name>Полный</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/InformationRegisters/ГрафикиРаботыМагазинов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает график работы магазина.
//
// Параметры:
//	Магазин			- СправочникСсылка.Магазины - магазин для получения графика.
//	НомерГода		- Число - Номер года, за который необходимо прочитать календарь.
//
// Возвращаемое значение
//	ТаблицаЗначений	- график работы магазина.
//
Функция ГрафикРаботыМагазина(Магазин, НомерГода) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("НомерГода", НомерГода);
	Запрос.УстановитьПараметр("Магазин",  Магазин);
	Запрос.УстановитьПараметр("ПустойМагазин", Магазин.Пустая());
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГрафикиРаботыМагазинов.ДатаКалендаря    КАК ДатаКалендаря,
	|	ГрафикиРаботыМагазинов.ВидДня           КАК ВидДня,
	|	ГрафикиРаботыМагазинов.ВидГрафикаРаботы КАК ВидГрафикаРаботы,
	|	ГрафикиРаботыМагазинов.Магазин          КАК Магазин
	|ИЗ
	|	РегистрСведений.ГрафикиРаботыМагазинов КАК ГрафикиРаботыМагазинов
	|ГДЕ
	|	ГрафикиРаботыМагазинов.Год = &НомерГода
	|	И ГрафикиРаботыМагазинов.Магазин = &Магазин
	|	И НЕ &ПустойМагазин
	|";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Записывает данные графика в регистр.
//
// Параметры:
//	Магазин		    - СправочникСсылка.Магазины - магазин для записи графика.
//	НомерГода	    - Число - Номер года, за который необходимо записать календарь.
//	ТаблицаРегистра - СписокЗначений - список значений, в котором указано, какие даты входят в календарь.
//
Процедура ЗаписатьДанныеГрафикаВРегистр(Магазин, НомерГода, ТаблицаРегистра) Экспорт
	
	НаборЗаписей = РегистрыСведений.ГрафикиРаботыМагазинов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Магазин.Установить(Магазин);
	НаборЗаписей.Отбор.Год.Установить(НомерГода);
	
	Для Каждого СтрокаТаблицыРегистра Из ТаблицаРегистра Цикл
		
		Строка = НаборЗаписей.Добавить();
		Строка.Магазин          = Магазин;
		Строка.Год              = НомерГода;
		Строка.ДатаКалендаря    = СтрокаТаблицыРегистра.ДатаКалендаря;
		Строка.ВидДня           = СтрокаТаблицыРегистра.ВидДня;
		Строка.ВидГрафикаРаботы = СтрокаТаблицыРегистра.ВидГрафикаРаботы;
		ЗаполнитьРесурсыЗаписиРегистра(Строка);
		
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

// Заполняет ресурсы "Пятидневка", "Шестидневка" и "КалендарныеДни".
//
// Параметры:
//  ЗаписьРегистра - РегистрСведенийМенеджерЗаписи.ГрафикиРаботыМагазинов - запись регистра сведений.
//
Процедура ЗаполнитьРесурсыЗаписиРегистра(ЗаписьРегистра) Экспорт
	
	// рабочий день
	Если ЗаписьРегистра.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий ИЛИ
		
		ЗаписьРегистра.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный Тогда
		
		ЗаписьРегистра.Пятидневка     = 1;
		ЗаписьРегистра.Шестидневка    = 1;
		ЗаписьРегистра.КалендарныеДни = 1;
		
		ЗаписьРегистра.РабочийДень = 1;
		
		// суббота
	ИначеЕсли ЗаписьРегистра.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Суббота Тогда
		
		ЗаписьРегистра.Пятидневка  = 0;
		ЗаписьРегистра.Шестидневка = 1;
		ЗаписьРегистра.КалендарныеДни = 1;
		
		Если ЗаписьРегистра.ВидГрафикаРаботы = Перечисления.ВидыГрафиковРаботы.Пятидневка Тогда
			
			ЗаписьРегистра.РабочийДень = 0;
			
		Иначе
			
			ЗаписьРегистра.РабочийДень = 1;
			
		КонецЕсли;
		
		// воскресение
	ИначеЕсли ЗаписьРегистра.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Воскресенье Тогда
		
		ЗаписьРегистра.Пятидневка  = 0;
		ЗаписьРегистра.Шестидневка = 0;
		ЗаписьРегистра.КалендарныеДни = 1;
		
		Если ЗаписьРегистра.ВидГрафикаРаботы = Перечисления.ВидыГрафиковРаботы.Пятидневка
		ИЛИ  ЗаписьРегистра.ВидГрафикаРаботы = Перечисления.ВидыГрафиковРаботы.Шестидневка Тогда
		
		ЗаписьРегистра.РабочийДень = 0;
			
		Иначе
			
			ЗаписьРегистра.РабочийДень = 1;
			
		КонецЕсли;
		
		// праздничный день
	Иначе
		
		ЗаписьРегистра.Пятидневка  = 0;
		ЗаписьРегистра.Шестидневка = 0;
		ЗаписьРегистра.КалендарныеДни = 0;
		
		ЗаписьРегистра.РабочийДень = 0;
		
	КонецЕсли;
		
КонецПроцедуры

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Магазин)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецЕсли
